packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000037a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>37</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T23:24:40.372428+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>HG2VgRFwj1TmCxdTrmV9Nj0JTpiaqO8bpPzjMyKkjtJbpHyW5S9qUHfZ/cX3QwwN
MtBWVoABPjTRjz69ZC+6HuiDkXOju8QrRrO+3cEBHncoJrNlhQIEs+OXpd3b0Hfp
JAmWBI5ZF5i0zIAxXZvZ8T9AbLAB2dPxzMh/eJRtSAQv6lYih+uG0bzcqoAR0Ocq
Cr1emfDXaKwB46Hv52RQjTMfnVFtCrMFUvn4+qDajJ21kQWLS+YC62vi7cV6eqTb
jkkHw9u2F0xrqa078rv93edEg884SVltRBGF5kcl+0UWc4GLcb9TacyA6yV5WQ20
VcVP560knjRnyTOG53ZcPg==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>uOgU68/aS+xPtDJf5d0ILdenmWXGB4lurGgW7eWUfXydb14xLvDlkza99ENNyay/
DXpiU7169c4rxSiurbaLwPofdqliD65jjCg412vNascymzpBQtPRwbL2TfrrrqEd
XvKm1Ft6dL4nHRU3Ifg14yN2jX5AAu8QCWHDffafUKxw1UQUqJBQ9jW0BNOAcToz
CvTMYmzdS7KEP06exWSstkmpTruOpB9PpqrKDeAxs+bTwJL9SXKMsIh5QZ+A8eSq
lZGp0v/PVDNxzPnhNsQjJTmw6348eY7HEpgHpx9ChYddzssCWCVqD/dirGoJO+vW
naqocODdr8C2Qp+LOBTi4ZM/QiM/2VZhQXB8haV7sKsMb36fwLlGFkY2syi0JnQI
/jbolamSj+/+HXjM8o/w0OegEqx+m8mkjFAk5J9UEiT+4N3xiMPyqMtCVu0KNCcC
Zzspfe/8694smo9vSkGDzheksH3E9bgEEnSQVnyS1aLsukqy/a0zIOMTMAzcElId
iHpqzqqFV7a8iF0OncQqIi2KlvnAPcbUw5x1LEShVl8IKRnVXXF5X27iNkp+ODS7
3ttkFMjUvZatjaq1LqYDiKi4reggwDKXzydJGQb6ePHr3frVog1tUvNPFBSStPyq
7te9jmnBjDCGb5b2Lme33k+gwUQZMKvKgctB/NS+xnMl7XEAHXWdTiB8Ri+yhwPf
zqTUjBtO8fnBxLot5awW7GI5K9kKOgWXETbvs8Mc2a/uNfjQQwwFwHlvyRh+l5Sn
fxEuW8P1gtLwEL+sPxTjAFsXZobmKPrVAGTH8Lf6XiKosCCj5q2nYGqBbKKOdY6u
zwHu/dOanBAIITgQCsEdUmcmKN+Nv2fjr0EwDdupYAQfrsbivPl5EQ8rNC0sVkl0
m/d9reHMsbtgaRboJHrpuhGQsSZwEr62mJ7URFOod8p1vIvetbyGOvlD8VyD5Nvv
Oosj4s8b2wfpBC4CugekLld6idXOSlqtRLZdTk6A1yntKauyHsb/XzMENRgmSgmt
FuSMPWDJGg5mwaKfMY95S2RcqUiD8AiX8FOi1MYbsnSH/zg4AD4eauLylXAbpVoe
aSMay4DTd5ucFmZ50bVBcqidbh3LPiq1meHou+v80Bmrut2D063hr9y6mq9Xl+mi
6YH4Xi8CGWWarF3z4EZEYWN5f+PXEv20UIqTSp5WCTxEEPZyZ9732XB5JswxL2xm
qSGmRhfHDQeuOzJPLgogAP1KjnBTU6bnL9u3D+mz3M3Z3EqRwQASdeXpKzYGw/61
q4yJZ1QoLT0bpYi/nUagvKMDOfk2OqzShxc/BYplHIC0zkHjJffAvn3oX2G+sJJ9
II3ezJl1GcxQZMxb6RaxeP7xyO/QDMJhEK3i6/+bOW4+TRnNzfU1kZVDhQVKFMaq
iYA+wgL7S+6aoglGjE69Yxzn/ON+ykyGlIvRWd6xWylUELTLXpWA8rjZy44fMlt/
DTEbSW/t32y2xWdlxgyQZozCpH5J65Hq/nYo5eP2YW6ruWNvnXbaH7voDTce9kvM
K5nBcY5dft5phM/P+fGUudDUGTe6uhjFHjjLV0lM1sp794BK9XoNDn6qdxQZCiIw
o2ZoJNyA4Dz2hJFMtXLBMJgG6FZBXC0hUaLBfV2rdZmo+ZbbRo6D+EFmb7lTljlx
fHNwR0P6W4FHudSpiP+WEaX0ehhozSPgrW5FczPn/3xpb8FLE+4uu/o3oIvx1h85
YPV2YQuE6v0rZmsgmIIw6JS3S3Y49g6ATQWL3K8Fv6ymRSOxTcgueGqmoLDsOgu1
8GD8065OF6a8ycfVJJTNzo183dP5h4YCtjC4PKTuynjEwB/JaGD2WUGZiQdvjyfC
uN10GTHCt12Rt40JYeqWHE+BLNrlJ2PaEBrUK0JG0DaNrNTNZ1i3Cb8I1JVYz3DI
xhYQem6IjzxY1SE5dvlcu/kHsYHxea7ZNUA8xyPbRMoDXedqj03es1Hr64Os11ZO
xxQULl40bj41Ljg0PCOagLTeeQ7jN+i5of7c8PSz2vYGMNIRXt80rKzgcNGmEEJ6
ErSRDKPdD9N3aPeQgi1HWNv02TesQ0IQ6TsHMYzGedA+XFxx0bWjb4V4UYEqIpx6
9bOmPeiwkcwwp5lV1AGprjFPEKD0pCvqA+Vs5NHe3hZ16L6ohpYAzglmQ3o02VsX
UAoLiWCUMmeAULNgf85jotAW8HRiCpbraBqziBYzZ2J8sS42ZDmX9tumaHYKezjr
aOKTsgMGztIp5NSdW77Xf4QUwRu5H3QazvaKittt9yIB0LUeSWmkER0ZdWxjf8Al
+hAp5OyPldEIyWv75eM/PCe22w6O8S1IrlY2L+Vwr/GcVubgI8mg+98wsS070fBs
AazMVTIvlBDAEWWNkjdRxNTVztO5pdnUYokk/shYkCDmgL6U+1WwBvc46JlgfoQc
9KkKFCkw910+1vEwrM7cdwTGLPqvoiSQI7uO0q8CEiSlTZu6FiWAnHXVezsS12ms
eHZCukgYJb8zOLkxvFL9vCULDRa+/U8q6HFMkpIgy3e4QIKvPWqkvAdjeOTdiFEP
eMmDJAXCKidZJtxddzCg3SqbvokcqvxEr1W2JKiOJzsJRVQ60uVCxbrGUmzCmlzT
wFR/i2gCTwnxkQTsGBE/78a8Nfra9wdEgmT+HaL4Dpva2fw2XKVRaci+vhmpjUSD
M0tDvqpRTuDkcT5OaZFr+EOTBzcmiCq9GO3IsNcXCsAmGk+arHJHog8WqLANI/iF
OFS+Z/Z/a/rp02tFoO6QMZR958ALSRxsy9+mCU9BLHeTUfRRsMqUFeNS6X7TN/TY
ICrbRmsiP0ZPf4k0OddqG97tFu2C0aHDc5wRyhdFrYIH/wLkNSlkjB5+GW5N6YDN
/276K6B8KNHg7D1R4GhnNmMSE+6XZObHdc0NTsJ/MmSr9zgsHFHEJMmKqSY1taN2
vCcuTiTPMDobf+2vB+x4m1HWIS50gOgdyzc/w/mxiMt7P79ROtF4acgs45htIV97
0QKcD10AQwYSnJdfMN5KT1aElZm5vchZ1GdjW+rOIhjGifOroIk305Xs9lCEX8WA
IXgMYhlxN2N3kXeAvsRtfWzzp8v4I/IJOcTE9rE8lcRSqXcRUV2qpvKY8vn9BIRJ
14SNEwk8MPKP1TyYqH5BNSyV63PVqJ1kRzBAvYd5ljD7CZgSgA0tpBthMDcU2s3Q
BX3COYZR0HCdFmUKhbJ4AFQgwV3fFWT2QDsIQExrkNLkfTuUaGxidRnVeg0R56Da
tjHUh7agcqRVbBUQp8ZZa04g0vQSt1j+XzEUfb1OSjo4EueAd+olr41nto6JmnnV
lWSswWtO5WmEjQE023oqsOEpdA2ZCKbdMmXfTu3PjZe6toxuBKd15HaM5x1djmkM
yb/YNJeWE3y7bqiFa6ti7UFXPoG4TTf8D0vLLZTkURbFxQit2Uto+Xh9j+eZtjln
XqWPrM98s7d7G2vapf1oETNF9+I4OxfuX0tniO4gebnVaP9bNKKTM15dO66Wd8+Q
4IWUWMY5hFTgdRe8rGWdgRu7Hp5a/a7joJsM8WHeEW8BtWJdeUriBParnVw7AROD
Pg6QvtsjMx8iOpvnuvYLYlSQiuf35d0KvhebaYKQwnO+KRGkaKrHHk6mNLJ8pJzq</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>